runTestCases/initialCases/03_planeJet/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
20480
(
(-9.84365 -0.5 0.00680157)
(-9.53097 -0.5 0.00680157)
(-9.21829 -0.5 0.00680157)
(-8.90563 -0.5 0.00680157)
(-8.59298 -0.5 0.00680157)
(-8.28034 -0.5 0.00680157)
(-7.96772 -0.5 0.00680157)
(-7.6551 -0.5 0.00680157)
...
)
;

boundaryField
{
    down
    {
        type            symmetry;
    }
    freestream
    {
        type            calculated;
        value           nonuniform List<vector> 
64
(
(-10 -0.5 0.500498)
(-10 -0.5 0.501575)
(-10 -0.5 0.502829)
(-10 -0.5 0.504288)
(-10 -0.5 0.505986)
(-10 -0.5 0.507961)
(-10 -0.5 0.51026)
(-10 -0.5 0.512936)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
64
(
(-10 -0.5 0.00680157)
(-10 -0.5 0.0203421)
(-10 -0.5 0.033758)
(-10 -0.5 0.0470503)
(-10 -0.5 0.0602202)
(-10 -0.5 0.0732689)
(-10 -0.5 0.0861974)
(-10 -0.5 0.0990069)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(200 -0.5 0.00894563)
(200 -0.5 0.0325641)
(200 -0.5 0.0676467)
(200 -0.5 0.114212)
(200 -0.5 0.17228)
(200 -0.5 0.241868)
(200 -0.5 0.322996)
(200 -0.5 0.415682)
...
)
;
    }
    up
    {
        type            symmetry;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<vector> 
64
(
(-9.84365 -0.5 0.5)
(-9.53097 -0.5 0.5)
(-9.21829 -0.5 0.5)
(-8.90563 -0.5 0.5)
(-8.59298 -0.5 0.5)
(-8.28034 -0.5 0.5)
(-7.96772 -0.5 0.5)
(-7.6551 -0.5 0.5)
...
)
;
    }
}


// ************************************************************************* //
