runTestCases/initialCases/03_planeJet/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
20480
(
0.00680157
0.00680157
0.00680157
0.00680157
0.00680157
0.00680157
0.00680157
0.00680157
...
)
;

boundaryField
{
    down
    {
        type            symmetry;
    }
    freestream
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
0.500498
0.501575
0.502829
0.504288
0.505986
0.507961
0.51026
0.512936
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
0.00680157
0.0203421
0.033758
0.0470503
0.0602202
0.0732689
0.0861974
0.0990069
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.00894563
0.0325641
0.0676467
0.114212
0.17228
0.241868
0.322996
0.415682
...
)
;
    }
    up
    {
        type            symmetry;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
0.5
0.5
0.5
0.5
0.5
0.5
0.5
0.5
...
)
;
    }
}


// ************************************************************************* //
