runTestCases/initialCases/03_planeJet/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
20480
(
301.43691
301.31485
301.18913
301.08796
301.00288
300.9222
300.8422
300.76325
...
)
;

boundaryField
{
    down
    {
        type            symmetry;
    }
    freestream
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 300;
        value           nonuniform List<scalar> 
64
(
299.95219
299.63172
299.08623
298.43665
297.80021
297.25799
296.84512
296.55985
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 315;
        value           nonuniform List<scalar> 
64
(
301.44879
301.44888
301.44907
301.44935
301.44972
301.45017
301.4507
301.45132
...
)
;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           nonuniform List<scalar> 
128
(
298.70449
298.70413
298.70269
298.69914
298.69216
298.68016
298.66137
298.6339
...
)
;
    }
    up
    {
        type            symmetry;
    }
    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
