runTestCases/initialCases/03_planeJet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "5";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
20480
(
(165.19868 0 -0.0089866803)
(165.74612 0 -0.012139614)
(166.48868 0 -0.010213931)
(167.15432 0 -0.0087234856)
(167.70404 0 -0.0084475114)
(168.19743 0 -0.0083034858)
(168.67571 0 -0.008024737)
(169.14703 0 -0.0077547766)
...
)
;

boundaryField
{
    down
    {
        type            symmetry;
    }
    freestream
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
64
(
(9.812213 0 0)
(27.233778 0 0)
(42.897965 0 0)
(56.110826 0 0)
(66.55926 0 0)
(74.310889 0 0)
(79.709304 0 0)
(83.235096 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
64
(
(165.19868 0 0)
(165.1981 0 0)
(165.19695 0 0)
(165.19525 0 0)
(165.19302 0 0)
(165.19026 0 0)
(165.187 0 0)
(165.18325 0 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    up
    {
        type            symmetry;
    }
    wall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
