runTestCases/initialCases/03_planeJet/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
20480
(
5.3904106e-05
6.223589e-05
6.1555949e-05
5.8331472e-05
5.6675415e-05
5.60115e-05
5.5640847e-05
5.53242e-05
...
)
;

boundaryField
{
    down
    {
        type            symmetry;
    }
    freestream
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
1.956322e-08
2.4423903e-08
3.2350019e-08
4.5615785e-08
6.8569376e-08
1.0994075e-07
1.8826988e-07
3.4574575e-07
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
5.1532603e-05
5.1564607e-05
5.1636162e-05
5.1744658e-05
5.1888964e-05
5.2068517e-05
5.2282986e-05
5.2532112e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.44276854
0.44291225
0.44337922
0.44450253
0.44668975
0.45039207
0.45604633
0.46399832
...
)
;
    }
    up
    {
        type            symmetry;
    }
    wall
    {
        type            compressible::alphatWallFunction;
        value           nonuniform List<scalar> 
64
(
4.1663204e-06
1.3533103e-06
1.1024953e-06
1.0499584e-06
1.0199724e-06
9.9153429e-07
9.6484791e-07
9.4072383e-07
...
)
;
    }
}


// ************************************************************************* //
