runTestCases/initialCases/03_planeJet/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
20480
(
0.0010875778
0.0010885615
0.0010891624
0.0010894012
0.0010895654
0.0010897196
0.0010898483
0.0010899461
...
)
;

boundaryField
{
    down
    {
        type            symmetry;
    }
    freestream
    {
        type            inletOutlet;
        inletValue      uniform 0.001087;
        value           uniform 0.001087;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.001087;
        value           uniform 0.001087;
    }
    outlet
    {
        type            zeroGradient;
    }
    up
    {
        type            symmetry;
    }
    wall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
64
(
19.160166
4.690958
3.73751
3.5863487
3.4863937
3.3745803
3.2644093
3.1636868
...
)
;
    }
}


// ************************************************************************* //
