runTestCases/initialCases/03_planeJet/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
20480
(
4.4999216e-05
5.1967419e-05
5.1451655e-05
4.8809291e-05
4.7464584e-05
4.6941969e-05
4.6662566e-05
4.6427872e-05
...
)
;

boundaryField
{
    down
    {
        type            symmetry;
    }
    freestream
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
1.5937596e-08
1.9950573e-08
2.6544745e-08
3.7631028e-08
5.6862889e-08
9.1575689e-08
1.5734782e-07
2.8962868e-07
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
4.3034871e-05
4.3061568e-05
4.3121266e-05
4.3211784e-05
4.333218e-05
4.3481983e-05
4.3660917e-05
4.3868766e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.37552508
0.37564651
0.37604074
0.37698897
0.37883513
0.3819597
0.38673051
0.39343767
...
)
;
    }
    up
    {
        type            symmetry;
    }
    wall
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
64
(
3.0160556e-06
9.8103762e-07
7.9945973e-07
7.6146741e-07
7.398854e-07
7.1950183e-07
7.0043858e-07
6.832634e-07
...
)
;
    }
}


// ************************************************************************* //
