runTestCases/initialCases/03_planeJet/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
20480
(
25.905697
25.915939
25.922258
25.924797
25.92654
25.928148
25.929466
25.930447
...
)
;

boundaryField
{
    down
    {
        type            symmetry;
    }
    freestream
    {
        type            inletOutlet;
        inletValue      uniform 25.9;
        value           uniform 25.9;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 25.9;
        value           uniform 25.9;
    }
    outlet
    {
        type            zeroGradient;
    }
    up
    {
        type            symmetry;
    }
    wall
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
64
(
1195992
1197132.7
1197461.4
1197619.7
1197883.1
1198287.7
1198799.8
1199389.2
...
)
;
    }
}


// ************************************************************************* //
