runTestCases/initialCases/03_planeJet/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
20480
(
103884.34
103816.65
103668.47
103521.5
103402.83
103301.55
103204.97
103109.31
...
)
;

boundaryField
{
    down
    {
        type            symmetry;
    }
    freestream
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 105986;
        value           nonuniform List<scalar> 
64
(
105926.91
105532.01
104864.66
104077.76
103314.91
102671.23
102184.91
101850.78
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 120191;
        value           nonuniform List<scalar> 
64
(
103851.28
103851.38
103851.59
103851.89
103852.29
103852.78
103853.36
103854.03
...
)
;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 101325; 
    }
    up
    {
        type            symmetry;
    }
    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
