runTestCases/initialCases/03_planeJet/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                  PCG;
        preconditioner          DIC;
        tolerance               1e-5;
        relTol                  0.;
    }

    pFinal
    {
       $p;
       relTol               0.;
    }

    "(h|U|k|omega|e)"
    {
        solver              PBiCGStab;
        preconditioner      DILU;
        tolerance           1e-8;
        relTol              0.;
    }

    "(h|U|k|omega|e)Final"
    {
        $U;
        relTol              0.;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    pRefCell        10;
    pRefValue       0;
}

SIMPLE
{
    nNonOrthogonalCorrectors    0;
    //consistent      yes;         // SIMPLEC

    residualControl
    {
        p               1e-8;
        U               1e-8;
        "(k|epsilon|omega)" 1e-8;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
        rho             0.01;
    }
    equations
    {
        U               0.7;
        e               0.5;
        "(k|omega)"     0.3;
    }
}

// ************************************************************************* //
